{ // Database connection string explanation and comments were written with ChatGPT's assistance

  // ConnectionStrings section defines database connection strings
  "ConnectionStrings": {
    // DefaultConnection is a named connection string you can use in your DbContext
    "DefaultConnection": "Data Source=SURAJ\\MSSQLSERVER01;Initial Catalog=finalise;Integrated Security=True;Connect Timeout=30;Encrypt=True;Trust Server Certificate=True;Application Intent=ReadWrite;Multi Subnet Failover=False"
    /*
      Explanation:
      - Server=(localdb)\\mssqllocaldb
        This specifies the SQL Server instance to connect to.
        "(localdb)\\mssqllocaldb" is a lightweight version of SQL Server for development,
        automatically installed with Visual Studio.

      - Database=EasyGamesStoreDb
        This is the name of the database that your application will connect to.
        EF Core will create this database if it does not exist when you run migrations.

      - Trusted_Connection=True
        This means the connection will use Windows Authentication instead of requiring a username/password.
        The current Windows user credentials will be used to access SQL Server.

      - MultipleActiveResultSets=true
        This allows multiple database operations to be active on the same connection simultaneously.
        For example, you can read data from one query while executing another query in the same DbContext.
    */
  },

  // Logging configuration section
  "Logging": {
    "LogLevel": {
      // Default log level for the application
      "Default": "Information",
      /*
        Explanation:
        - "Information" means general runtime events are logged.
        - Typical events include HTTP requests, database queries, and system events that are important
          but not errors.
      */

      // Specific log level for ASP.NET Core framework messages
      "Microsoft.AspNetCore": "Warning"
      /*
        Explanation:
        - Only warnings or higher severity messages (errors, critical) from ASP.NET Core will be logged.
        - This reduces noise from routine framework operations.
      */
    }
  },

  // AllowedHosts controls which hosts/domains can access your app in production
  "AllowedHosts": "*"
  /*
    Explanation:
    - "*" means all hosts are allowed.
    - In production, you might replace this with specific domains for security, e.g.,
      "example.com;www.example.com".
  */
}
